[
	{
		"name": "deliver-radiant",
		"headline": "A Very Important Package",
		"article": "A messenger rode into town today, carrying with them a very important parcel. The contents of which must remain sealed until it reaches it's target, but the courier says he can take it no further without an escort into dangerous territory. The whole town is curious about the letters contents, and wants adventurers to accompany the messenger.",
		"image": "letter-bomb"
	},
	{
		"name": "help-neighbour-radiant",
		"headline": "Please, Take This Gold!",
		"article": "Our adventurers return from the nearby town with pouches full of gold. Somehow, a magical portal had opened and was flooding the town with gold pieces, which sounded nice at first until the weight started causing the town to sink into the ground. Luckily our adventurers closed the portal and helped relieve the town of it's gold problem."
	},
	{
		"name": "madmans-map-1",
		"headline": "Local Madman Discloses \"Totally Real Treasure\"",
		"article": "Everyone's favourite raving lunatic, Old Man Penterghast, is finally back in town much to the delight of the many tavern patrons left un-pestered during his absence. In an exclusive interview, the beloved, old kook mentioned a great treasure hidden in the forests."
	},
	{
		"name": "madmans-map-1-complete",
		"headline": "The Power of Friendship",
		"article": "After days following the madman Penterghast's map, our adventurers have returned, with a camaraderie never stronger. As it turns out, the TRUE treasure was the friendship they made along the way. Also, these really cool swords they found."
	},
	{
		"name": "herolympics-1",
		"headline": "Herolympics!",
		"article": "One of our adventurers has been nominated to partake in the world hero championship! They've got the brains, the brawn, and a charming personality. All they need now is a good set of armour to show off. Apparently, there is a master craftswoman a little ways from here, if we were to convince her to make something special...",
		"image": "strong"
	},
	{
		"name": "herolympics-2",
		"headline": "Fourth Place Ain't Too Bad!",
		"article": "While the armour was the talk of the swimsuit section of the competition, it unfortunately did not lead to our hero's victory. However, the craftswoman likes our towns scrappy attitude, and wants to come in and train up some more armour-smiths.",
		"image": "Armoury"
	},
	{
		"name": "dragon-hunting-1",
		"headline": "Dragon On The Decision",
		"article": "Conservationists and adventurers' disagreements have come to a head today after a heated debate over what to do about the steadily more dangerous dragon-related fires popping up around the town. While many adventurers would relish the chance to receive a chunk of coin for slaying the beasts, many claim this would throw of nature's delicate balance.",
		"image": "spiked-dragon-head",
		"choices":
		[
			{
				"name": "Save the Dragons",
				"outcomes":
				[
					{
						"type": "FlavourText",
						"customDescription": "How will we defend ourselves?"
					}
				]
			},
			{
				"name": "It's Hunting Season!",
				"outcomes":
				[
					{
						"type": "FlavourText",
						"customDescription": "How will the dragons react?"
					}
				]
			}
		]
	},
	{
		"name": "dragon-hunting-2",
		"headline": "It's Open Season on the Scaled Nuisance",
		"article": "In a surprise upset during a town council meeting, adventurers have had their way thanks to a final decision from the mayor, allowing local quest-givers to request the slaying of dragons. Up until now these dragons really kept to their own, but we'll show THEM whose boss!",
		"image": "spiked-dragon-head",
		"outcomes":
		[
			{
				"customDescription": "It turns out dragons are far deadlier than expected. And now they're mad."
			},
			{
				"customDescription": "The dragons start attacking (+5 Threat)"
			}
		],
		"headliner": false
	},
	{
		"name": "dragon-hunting-3",
		"headline": "\"It's a very big wall\"",
		"article": "This morning's town meeting ended as expected with the mayor siding with conservationists in an effort to live peacefully alongside the dragon menace. The faction proceeded to detail their plan to build a wall to keep the dragons out. Many are still wondering how such a wall would stop dragons flying over or indeed around it.",
		"image": "stone-wall"
	},
	{
		"name": "dwarf-kicker-1",
		"headline": "Too Big for Their Boots?",
		"article": "Locals and adventurers alike cower in their cowardly fear as eye-witness stories continue to stream in about The Dwarf Kicker. Reports describe the assailant as a man with one very large boot that he uses to kick over dwarves in order to steal their coin purses. More to follow.",
		"image": "boot-kick"
	},
	{
		"name": "dwarf-kicker-2",
		"headline": "\"Why are you all laughing at my misfortune?\" ",
		"article": "The town's populace has finally begun to find the humour in the continuation of dwarf-kicking crimes as Dwarf Kicker Mania begins to take the town by storm! There is simply no funnier sight than a dwarf rolling on their back like a turtle, unable to get back up.",
		"image": "dwarf-face"
	},
	{
		"name": "dwarf-kicker-3",
		"headline": "Tipping for a Winner",
		"article": "Dwarf-tipping has quickly become a much loved pastime amongst the town's children, who've invented the so-called \"Dwarf Tipper Challenge\", in which participants are encouraged to roll these stocky fellows down hills for a good old laugh.",
		"image": "dwarf-face"
	},
	{
		"name": "dwarf-kicker-4",
		"headline": "Short But Not So Sweet",
		"article": "The national peak-body for dwarves and halflings, Council for the Height-Impeded, has today released a new report on the sharp rise in hate-crimes committed against those vertically-challenged members of society, threatening to halt all trade of precious and shiny materials in blanket boycott of the town.",
		"image": "dwarf-face"
	},
	{
		"name": "jewellers-1",
		"headline": "The Ghost of Dragons Past",
		"article": "An adventurers uncle (who just happens to be a dragon) has recently passed away, and bequeathed him a hoard of raw gemstones. The only condition being they have to spend one night in the dragons lair, which is rumoured to be haunted.",
		"image": "spiked-dragon-head"
	},
	{
		"name": "jewellers-2",
		"headline": "I Would've Gotten Away With it, Too...",
		"article": "The adventurer returns, gems in hand. As it turns out there was no ghost, just the dragons old business partner in a mask, trying to claim the hoard for himself. The gems in their own aren’t worth much, but in the right hands could gain magical properties.",
		"image": "haunting"
	},
	{
		"name": "food-review-3",
		"headline": "Food Review: Enchanted Pastries",
		"article": "We took a visit to Granny X's enchanted pastry shop",
		"image": ""
	},
	{
		"name": "food-review-4",
		"headline": "Food Review: ",
		"article": "",
		"image": ""
	}
	
]
