[
  {
    "name": "dnd",
    "headline": "New Game a 'Hell' of a Time",
    "article": "Local children have been playing a new game, where they pretend to be adventurers going on quests. Apparently it is so fun that even a group of nearby demons want to join in!",
    "image": "dice-twenty-faces-twenty",
    "type": "Flavour"
  },
  {
    "name": "doomsday",
    "headline": "Doomsday Forecast for Wednesday",
    "article": "Local doomsayer Premonitia Portent has forecast doomsday for this Wednesday. This is the 4th time this month they've prophesied the end times, but they only need to be right once!",
    "image": "cultist",
    "type": "Flavour"
  },
  {
    "name": "esquilax",
    "headline": "Fabled Beast Spotted Nearby",
    "article": "Witnesses claim to have seen the mythical Esquilax!. Based on our readings of <i>\"The Big Book of Beasts\"</i>, it has been described as <i>\"A horse, with the head of a rabbit, and the body, of a rabbit.\"</i>",
    "image": "rabbit",
    "type": "Flavour"
  },
  {
    "name": "gemstones",
    "headline": "Could Eating Gemstones Give You Magic Powers?",
    "article": "Local Witchdoctor and magic expert says: <i>\"What? No. Don't do that!\"</i>\n\nBut you're not fooling me, Mr Magic... Not again.",
    "image": "minerals",
    "type": "Flavour"
  },
  {
    "name": "kitten-inn",
    "headline": "They're Kitten About Safety Standards!",
    "article": "A local inn has received scathing reviews over its weekend grand-opening when several high-ranking town gentry in attendance were transformed into house cats upon trying the <i>\"new soup\"</i>. The commissioner of the Magical Safety Standard Alliance had this to say about the incident: <i>\"meow? meoooooow\"</i> followed by faint purring.",
    "image": "cat",
    "type": "Flavour"
  },
  {
    "name": "magic-dust",
    "headline": "Magic Dust Bust Plus",
    "article": "Big victory today for our boys in bronze as the Dust Enforcement Administration bags a massive load from Magic Dust traffickers caught attempting to smuggle 7000 gold pieces of product inside a bag of holding. The traffickers state that they did not pack their bags themselves.",
    "image": "dust-cloud",
    "type": "Flavour"
  },
  {
    "name": "malecrax",
    "headline": "'Tis the Season!",
    "article": "We spend today, as we do every year, to celebrate the glorious Archmage Malecrax for choosing yet again not to destroy the sun and plunge us all into darkness. Thank you Malecrax!",
    "image": "overlord-helm",
    "type": "Flavour"
  },
  {
    "name": "metagaming",
    "headline": "No Metagaming!",
    "article": "Local villager wishes she was in a farming sim instead: <i>\"If I was in one of those games I could just wander around and occasionally receive gifts!\"</i> Experts claim they have no idea what she’s on about and that she’s lost her mind.",
    "image": "dice-twenty-faces-twenty",
    "type": "Flavour"
  },
  {
    "name": "pocket-pub",
    "headline": "Patrons Puzzled by Pocket Pub",
    "article": "Local tavern, The Drowned Pelican, has called for an investigation following a prank that lead to their front door being transmuted into a pocket dimension. While the debacle only lasted for 15 minutes before conduits were able to reverse the spell, the victims had aged more than 15 years inside a hellish nightmare realm where the bard kept playing the same song over again.",
    "image": "open-gate",
    "type": "Flavour"
  },
  {
    "name": "potion-buyer",
    "headline": "Local Adventurer Needs Potions",
    "article": "He is going into battle and needs the strongest potions available. Will they get them? Is he strong enough? Read more to find out...",
    "image": "potion-ball",
    "type": "Flavour"
  },
  {
    "name": "potion-seller",
    "headline": "Potion Seller Comes to Town",
    "article": "He was last seen in this town engaged with an argument with a local outrider on the potency of his potions. Are you strong enough for his potions?",
    "image": "potion-ball",
    "type": "Flavour"
  },
  {
    "name": "banned-spells-1",
    "headline": "Banned Spells Announcement",
    "article": "Due to health and safety concerns, the following spells can no longer be cast:\n •  Ceaseless Bees\n •  Reverse Breathing\n •  Wall of Meat",
    "image": "scroll-quill",
    "type": "Flavour"
  },
  {
    "name": "banned-spells-2",
    "headline": "Conjuration Castings are Cancelled",
    "article": "Certain spells are banned from casting following an ethics review:\n •  Greater Summon Gnome\n •  Conjure Friend\n •  Summon Greater Gnome",
    "image": "scroll-quill",
    "type": "Flavour"
  },
  {
    "name": "banned-spells-3",
    "headline": "Royal Spell Bans",
    "article": "Following a royal decree, the following spells have been banned from non-authorized use:\n •  Zone of Tax Evasion\n •  Repress Trauma\n •  Powerword Gaslight",
    "image": "scroll-quill",
    "type": "Flavour"
  },
  {
    "name": "banned-spells-4",
    "headline": "Spells Deemed Useless",
    "article": "Following a review by the arcanists guild, these spells have been deemed non-viable for public use:\n •  Retroactive Foresight\n •  Lightvision\n •  Intangible Shield",
    "image": "scroll-quill",
    "type": "Flavour"
  },
  {
    "name": "banned-spells-5",
    "headline": "Secret Spells Banned",
    "article": "The unknown order has alerted us to immediately stop any casting, and learning, of these spells:\n •  Manipulate Skin\n •  Speak with Houseplant\n •  Counter-Manipulate Skin",
    "image": "scroll-quill",
    "type": "Flavour"
  },
  {
    "name": "rat-rave",
    "headline": "Perplexing Piper Party",
    "article": "Children have been seen disappearing at night, in a trance. After some exploration, adventurers discovered that they have been attending a nightly rat rave.",
    "image": "rat",
    "type": "Flavour"
  },
  {
    "name": "socks",
    "headline": "Socks Outlawed!",
    "article": "A group of fanatics have pressured the government to issue a kingdom wide ban on socks, of all things. Starting tomorrow, any citizens caught wearing, distributing, or in possession of fabric footwear will be exiled.",
    "image": "socks",
    "type": "Flavour"
  },
  {
    "name": "little-guy",
    "headline": "Little Guy Spotted in Town",
    "article": "Don't even worry about it, he's just like, a cool little guy, a little dude. He's not hurting anyone, don't even sweat.",
    "image": "meeple",
    "type": "Flavour"
  },
  {
    "name": "twin",
    "headline": "Long Lost Twin",
    "article": "After a battle with a frost troll, we have unfortunately lost an adventurer today. Conveniently, however, their long lost twin has just arrived in town, and has taken up residence.",
    "image": "twin",
    "type": "Flavour",
    "outcomes":
    [
      {
        "type": "AdventurersRemoved",
        "count": 1,
        "anyGuild": true,
        "kill": true
      },
      {
        "type": "AdventurersAdded",
        "count": 1,
        "anyGuild": true
      }
    ]
  },
  {
    "name": "bucket-head",
    "headline": "Robbery 'Pails' in Comparison",
    "article": "A series of robberies have left shop owners with buckets on heads and their stores robbed! How the bucket appeared on their head, and why they didn't think to take it off remains a mystery, but when it was finally removed by a kindly adventurer, the store was stripped bare.\n\nLuckily for the owners (and unluckily for the treasury), the shop was completely insured.",
    "image": "twin",
    "type": "Flavour",
    "outcomes":
    [
      {
        "type": "ModifierAdded",
        "modifier": {
          "toChange": "Spending",
          "amount": -5,
          "turns": 3,
          "reason": "from Bucket Head Robberies"
        }
      }
    ]
  },
  {
    "name": "gorath-1",
    "headline": "Why Townsfolk HATE This Rogue!",
    "article": "Brave adventurer, dashing rogue, usual suspect, and professional idiot are just some of the terms used to describe <b>Gorath</b> by both himself and others. We all know why it is that we hate him, so there's no need to elaborate on the topic, but man, I hate that guy so much!",
    "image": "hooded-figure",
    "type": "Flavour"
  },
  {
    "name": "gorath-2",
    "headline": "Rogue, Light?",
    "article": "Local rogue <b>Gorath</b> was seen floating above the town today, taunting a pack of brawlers just out of reach after reportedly drinking a potion of levitation. I swear, it's something new with this guy every day...",
    "image": "potion-ball",
    "type": "Flavour",
    "outcomes":
    [
      {
        "type": "ModifierAdded",
        "modifier": {
          "toChange": "Brawler",
          "amount": -1,
          "turns": 3,
          "reason": "from the Taunting Floating Rogue"
        }
      }
    ]
  },
  {
    "name": "gorath-3",
    "headline": "Eighth Time's a Charm",
    "article": "Local screw-up, <b>Gorath the Rogue</b>, has fallen into the town well for the eighth time this season, once again attempting to pilfer coins after mistaking it for a wishing well. Diviners are very angry about having to use Gorath-flavoured water in their rituals.",
    "image": "hooded-figure",
    "type": "Flavour",
    "outcomes":
    [
      {
        "type": "ModifierAdded",
        "modifier": {
          "toChange": "Diviner",
          "amount": -1,
          "turns": 3,
          "reason": "from the Gorath Water"
        }
      }
    ]
  },
  {
    "name": "gorath-4",
    "headline": "The Rogue Who Stole Afternoon Tea",
    "article": "Well know scoundrel, <b>Gorath</b>, made off with the whole town's lunch yesterday in an act of whimsical foolishness. The town had gathered for a traditional afternoon feast, when their picnic basket of holding had been stolen. Gorath claims he just wanted a cookie and it slipped into a nearby portal.",
    "image": "hooded-figure",
    "type": "Flavour",
    "outcomes":
    [
      {
        "type": "ModifierAdded",
        "modifier": {
          "toChange": "Food",
          "amount": -5,
          "turns": 3,
          "reason": "from the Missing Picnic Basket"
        }
      }
    ]
  },
  {
    "name": "diviner-dating",
    "headline": "Blind Date With a God",
    "article": "A local gathering of priests have established a new matchmaking service for pairing lost individuals with prospective deities. The process has been an acclaimed success, seeing a 50% increase in attendance of religious events. Gra'kthuk the Bloody had this to say: <i>\"I was so lost until I was introduced to Xanthilox the Eater of Souls, God of Incandescent Rage. I feel like my purpose has been renewed in this world!\"</i>",
    "image": "twin",
    "type": "Flavour",
    "outcomes":
    [
      {
        "type": "ModifierAdded",
        "modifier": {
          "toChange": "Diviner",
          "amount": 2,
          "turns": 3,
          "reason": "from Biblical Blind Dating"
        }
      }
    ]
  },
  {
    "name": "licenced-spells",
    "headline": "Licence-Free Spells!",
    "article": "Why spend all that extra gold on name-brand spells like <i>'Malecrax's Sycthe, Lenny's Lil House, or Talia's Horrific Chuckles'</i> when you can get our generic spells of similar quality for less!",
    "image": "scroll-quill",
    "type": "Flavour",
    "outcomes":
    [
      {
        "type": "ModifierAdded",
        "modifier": {
          "toChange": "Arcanist",
          "amount": 2,
          "turns": 3,
          "reason": "from Licence-Free Spells"
        }
      }
    ]
  },
  {
    "name": "living-wood",
    "headline": "Magic Wood Found in Nearby Forest!",
    "article": "Silkhelm, otherwise known as <i>'Living Wood'</i> has been discovered. This supernaturally strong wood is lucrative, so if you've got an axe free, get chopping! Warning, faint screaming may be heard, and should be ignored.",
    "image": "tree-face",
    "type": "Flavour",
    "outcomes":
    [
      {
        "type": "FlavourText",
        "customDescription": "We've made a tidy profit selling all this <i>wood</i>..."
      },
      {
        "type": "WealthAdded",
        "turnsWorth": 0.3
      }
    ]
  },
  {
    "name": "wolf-loot-drops",
    "headline": "Loot From Strange Places",
    "article": "In a mysterious turn of events, local adventurers have started finding coins, health potions, and even a whole sword on the bodies of the local wolf population! Where and how these wolves are keeping this loot is a mystery, but it's hunting season!\n\nThe outrider's guild has expressed concerns for the dipping wolf populations following this news: <i>\"We all want loot, but we must remember to allow for the appropriate respawn rate.\"</i>",
    "image": "tree-face",
    "type": "Flavour",
    "outcomes":
    [
      {
        "type": "FlavourText",
        "customDescription": "We've made some money off all these extra items..."
      },
      {
        "type": "WealthAdded",
        "turnsWorth": 0.4
      },
      {
        "type": "ModifierAdded",
        "modifier": {
          "toChange": "Outrider",
          "amount": -1,
          "turns": 3,
          "reason": "from Wolf Overhunting"
        }
      }
    ]
  },
  {
    "name": "protagonist",
    "headline": "\"But I'm The Protagonist\"",
    "article": "Local adventurer has come to the shocking realisation that this world might not actually be entirely in service of their grand heroes journey.\n\n<i>\"I thought I was the main character! And now there's all these people telling me they have their own lives when I'm not here? Honestly I appreciate the immersion factor, but this is unacceptable!\"</i>",
    "image": "shattered-heart",
    "type": "Flavour"
  },
  {
    "name": "mimic-bracelets",
    "headline": "Fraudship Bracelets!",
    "article": "Latest hot craze <i>\"friendship bracelets\"</i> are a total scam! Our reporters have uncovered that they are actually just lonely mimics seeking companionship.",
    "image": "torc",
    "type": "Flavour"
  },
  {
    "name": "adventurer-advert",
    "headline": "Lost in Life?",
    "article": "Lacking career prospects? Ready to fight for what's right? Family has a sizable fortune?\n\nWell you sound like the perfect candidate to become an adventurer! Visit your closest Guild Co. representative today.",
    "image": "swords-power",
    "type": "Flavour"
  },
  {
    "name": "changelings",
    "headline": "Reminder",
    "article": "Changelings are people, just like you and me...\n\nThis is why they must be eradicated <b>at all costs</b>!",
    "image": "anatomy",
    "type": "Flavour"
  },
  {
    "name": "siren-psa",
    "headline": "Reminder to Beach Goers",
    "article": "The siren songs are harmless and to be expected.\n\nIf the singing stops, however, <b>evacuate immediately</b>.",
    "image": "mermaid",
    "type": "Flavour"
  },
  {
    "name": "health-potion",
    "headline": "Did You Know?",
    "article": "The cost of a single health potion is enough to feed a family of five for a year?\n\nRemember to donate to your local Guild Co. representatives, to help afford such an important cost.",
    "image": "health-potion",
    "type": "Flavour"
  },
  {
    "name": "mimic-furniture",
    "headline": "Watch Out!",
    "article": "Does your furniture not look quite how you remember it?\n\nMimics can be anywhere, so next time, check before you sit!",
    "image": "sofa",
    "type": "Flavour"
  },
  {
    "name": "item-demonic-key",
    "headline": "Mysterious Key Appears!",
    "article": "A strange key appeared in the pocket of an adventurer overnight. They have no recollection of obtaining it, but now everyone is curious about finding its lock.",
    "image": "skeleton-key",
    "type": "Flavour",
    "outcomes": [
      {
        "type": "SetFlag",
        "flag": "DemonicKey",
        "value": true,
        "customDescription": "It glows with a demonic aura... I wonder what it opens?"
      }
    ]
  }
]
