[{"name":"Beetles","headline":"Hello Beetles, Goodbye Beetles","article":"Giant monsterous beetles migrating from the strawberry fields terrorising the town this morning with loud melodic buzzing from the rooftops. Town etymologist had hoped they would have moved along yesterday. The blackbird population is reportedly under attack from these creatures. Local blacksmith Maxwell claims he has just the right tool for the situation...","image":"scarab-beetle","choices":[],"outcomes":[]},{"name":"Bread Swords","headline":"Bread-y for War!","article":"The famous illiterate adventuring group \"The Unreadables\" was found in a tough spot going up against a water elemental, while arming themselves to the teeth with baguettes and brioches after mistaking the local bakery for a blacksmith.","image":"bread","choices":[],"outcomes":[]},{"name":"D&D","headline":"New Game a 'Hell' of a Time","article":"Local children have been playing a new game, where they pretend to be adventurers goin on quests. Apparently it is so fun that even a group of nearby demons want to join in!","image":"dice-twenty-faces-twenty","choices":[],"outcomes":[]},{"name":"Doomsday Jamie","headline":"Doomsday Forecast for Wednesday","article":"Local Doomsayer Jamie has forecast doomsday for this Wednesday. This is the 4th time this month he's prophesied the end times, but he only needs to be right once!","image":"cultist","choices":[],"outcomes":[]},{"name":"Esquilax","headline":"Fabled Beast Spotted Nearby","article":"Witnesses claim to have seen the mythical Esquilax!. Based on our readings of \"The Big Book of Beasts\", it has been described as \"A horse, with the head of a rabbit, and the body, of a rabbit\".","image":"rabbit","choices":[],"outcomes":[]},{"name":"Feeding Day","headline":"Feeding Day is Upon Us!","article":"As it does every year, town prepares for its annual feeding day, when townsfolk come together to celebrate the sating of the beast. As is tradition, each home leaves a fresh ham upon their doorstep tomorrow night. Residents are being urged to purchase their hams quickly to avoid a long and agonising death for them and their loved ones this holiday season.","image":"behold","choices":[],"outcomes":[]},{"name":"Floating Rogue","headline":"Rogue Light?","article":"Local rogue Hiram Stealemlots was seen floating above the town today, after reportedly drinking a potion of levitation. I swear, it's something new with this guy every day.","image":"potion-ball","choices":[],"outcomes":[]},{"name":"Gemstones","headline":"Could Eating Gemstones Give you Magic Powers?","article":"Local Witchdoctor and magic expert says: \"What? No. Don't do that!\" But you're not fooling me, Mr Magic... Not again. ","image":"minerals","choices":[],"outcomes":[]},{"name":"Humming Lights","headline":"Mysterious Lights won't Stop Humming","article":"The strange dancing lights off the east side of town have started singing a little tune! Some claim it's cheerful, others ominous. Local residents have reported asking, \"Oh God, oh God why won't they stop? Please, someone, make them stop.\"","image":"music-spell","choices":[],"outcomes":[]},{"name":"Kitten Inn","headline":"They Have to be Kitten About Safety Standards","article":"A local inn has received scathing reviews over its weekend grand-opening when several high-ranking town gentry in attendance were transformed into house cats upon trying the \"new soup\". The commissioner of the Magical Safety Standard Alliance had this to say about the incident: \"meow meoooooow\" followed by faint purring.","image":"cat","choices":[],"outcomes":[]},{"name":"Magic Dust","headline":"Magic Dust Bust Plus","article":"Big victory today for our boys in bronze as the Dust Enforcement Administration bags a massive load from Magic Dust traffickers caught attempting to smuggle 7000 gold pieces of product inside a bag of holding. The traffickers state that they did not pack their bags themselves.","image":"dust-cloud","choices":[],"outcomes":[]},{"name":"Malecrax","headline":"'Tis the Season!","article":"We spend today, as we do every year, to celebrate the glorious Archmage Malecrax for choosing yet again not to destroy the sun and plunge us all into darkness. Thank you Malecrax!","image":"overlord-helm","choices":[],"outcomes":[]},{"name":"Metagaming","headline":"No Metagaming!","article":"Local villager wishes she was in a farming sim instead. “In those you just have to wander around and occasionally receive gifts”.  Experts claim they have no idea what she’s on about and that she’s lost her mind.","image":"dice-twenty-faces-twenty","choices":[],"outcomes":[]},{"name":"Mimic Sword","headline":"These Mimics are Sharp!","article":"Local adventurer returns gloriously from defeating a cave of mimics, only for his sword to try and eat him before running off. The whereabouts of this sword are unknown, so keep an eye out for any household items you don't remember buying!","image":null,"choices":[],"outcomes":[]},{"name":"Murder Mystery","headline":"A Not-So Mysterious Murder Mystery","article":"Authorities still on the lookout for the culprits of the Dark Manor murders, after being fooled by the kitschy bed and breakfast spot into participating in an \"immersive murder-mystery extravaganza\" event late last week. Turns out it was the bell-hop in the ballroom with the scythe.","image":"reaper-scythe","choices":[],"outcomes":[]},{"name":"Pocket Pub","headline":"Patrons Puzzled by Pocket Pub","article":"Local tavern, The Drowned Pelican, has called for an investigation following a prank that lead to their front door being transmuted into a pocket dimension. While the debacle only lasted for 15 minutes before conduits were able to reverse the spell, the victims had aged more than 15 years inside a hellish nightmare realm where the bard kept playing the same song over again.","image":"open-gate","choices":[],"outcomes":[]},{"name":"Potion Buyer","headline":"Local Adventurer Needs Potions","article":"He is going into battle and needs the strongest potions available. Will they get them? Is he strong enough? Read more to find out...","image":"potion-ball","choices":[],"outcomes":[]},{"name":"Potion Seller","headline":"Potion Seller Comes to Town","article":"He was last seen in this town engaged with an argument with a local Outrider on the potency of his potions. Are you strong enough for his potions?","image":"potion-ball","choices":[],"outcomes":[]},{"name":"Rat Rave","headline":"Perplexing Piper Party","article":"Children have been seen disappearing at night, in a trance. After some exploration, adventurers discovered that they have been attending a nightly rat rave.","image":"rat","choices":[],"outcomes":[]},{"name":"Socks","headline":"Socks Outlawed!","article":"A group of fanatics have pressured the government to issue a kingdom wide ban on socks, of all things. Starting tomorrow, any citizens caught wearing, distributing, or in possession of fabric footwear will be exiled.","image":"socks","choices":[],"outcomes":[]},{"name":"Stars","headline":"Up to the Stars","article":"Three extra stars have been discovered last night in the southern sky. They definitely weren't there before, and local cosmic diviners warn against looking at them for too long in case you start seeing things that DEFINITELY AREN'T THERE","image":"stars-stack","choices":[],"outcomes":[]},{"name":"Tooth Fairy","headline":"The Tooth Hurts","article":"A warning to any parents out there, urge your children against putting loose teeth under their pillows for the Tooth fairies. While they seem whimsical and wondrous, they are in fact just the larval stage of the far more deadly 'Bone fairy'. Hide your teeth! It's better to starve them before they get too strong.","image":"fairy","choices":[],"outcomes":[]},{"name":"Twin","headline":"Long Lost Twin","article":"After a battle with a frost troll, we have unfortunately lost an adventurer today. Convieniently, however, their long lost twin has just arrived in town, and has taken up residence.","image":null,"choices":[],"outcomes":[{"type":4,"customDescription":null,"count":0,"nextEvent":{"name":null,"headline":null,"article":null,"image":null,"choices":null,"outcomes":null},"nextName":null,"toFront":false,"adventurers":null,"guild":0,"kill":false,"buildingType":0,"questConfig":{"type":null,"customDescription":null,"nextEvent":{"name":null,"headline":null,"article":null,"image":null,"choices":null,"outcomes":null},"nextName":null,"toFront":false,"count":0,"guild":0},"questName":{"type":null,"customDescription":null,"nextEvent":{"name":null,"headline":null,"article":null,"image":null,"choices":null,"outcomes":null},"nextName":null,"toFront":false,"count":0,"guild":0}},{"type":3,"customDescription":null,"count":0,"nextEvent":{"name":null,"headline":null,"article":null,"image":null,"choices":null,"outcomes":null},"nextName":null,"toFront":false,"adventurers":null,"guild":0,"kill":false,"buildingType":0,"questConfig":{"type":null,"customDescription":null,"nextEvent":{"name":null,"headline":null,"article":null,"image":null,"choices":null,"outcomes":null},"nextName":null,"toFront":false,"count":0,"guild":0},"questName":{"type":null,"customDescription":null,"nextEvent":{"name":null,"headline":null,"article":null,"image":null,"choices":null,"outcomes":null},"nextName":null,"toFront":false,"count":0,"guild":0}}]},{"name":"Undead Diviner","headline":"Diviner Just Won't Give Up!","article":"This holy warrior is on a mission, and keeps coming back to life. We don't know why, and at this point, it's becoming a bit of a hassle.","image":"angel-wings","choices":[],"outcomes":[]},{"name":"Vampire Cosplay","headline":"The Undead Are Dead!","article":"Tragedy unfolded at a local inn last night, as regional vampire cosplay and literature organisation, The Undead Poets Society, held their annual gala dinner, only to be brutally slain by a rogue team vampire hunters who embarrassingly mistook them for real the real deal.","image":"resting-vampire","choices":[],"outcomes":[]},{"name":"Well Eye","headline":"Well, Well Well, Look What Eye Have Here!","article":"A monstrous eye has been found living at the bottom of our local water hole? Our on the field reporter described peering into the well akin to \"Delving into the abyss itself... Where the true master of our world lies... Sorry, what were we talking about?\"","image":"behold","choices":[],"outcomes":[]}]