{
	"Brawler": [
		{
			"name": "attract-brawlers",
			"addedHeadline": "Meat Shields Wanted!",
			"addedArticle": "\"The other adventurers keep asking us for more 'meat shields'. I don't know what they mean but maybe if we get some more of us, one of them will know!\"",
			"addedImage": "Stats/Brawler",
			"completeHeadline": "Meat Shield Mystery",
			"completeArticle": "\"We never learned what the other adventurers meant, but at least they're happy now\" one brawler said while being pushed toward some deadly thing, idk write your own joke.",
			"completeImage": "Stats/Brawler",
			"type": "AttractAdventurers"
		}, {
			"name": "build-blacksmiths",
			"addedHeadline": "More Pointy Things!",
			"addedArticle": "The Brawlers are running on a worryingly low supply of dangerous implements, there just aren't enough Blacksmiths to go around. Let's fix that.",
			"addedImage": "Buildings/Blacksmith",
			"completeHeadline": "Now THIS is a Lot of Pointy Things!",
			"completeArticle": "The Brawlers are now satisfied with the amount of deadly weapons in their possession. Could always use more, though.",
			"completeImage": "Buildings/Blacksmith",
			"type": "ConstructBuildings",
			"buildingType": "Blacksmith"
		}, {
			"name": "destroy-libraries",
			"addedHeadline": "Death to Books!",
			"addedArticle": "The brawlers are fighting their greatest enemy, illiteracy, and need your help! \"They say words can't die, but words ain't met me!\" one brawler was heard chanting to no one in particular.",
			"addedImage": "Buildings/Library",
			"completeHeadline": "Book Burning Ends in (More) Tragedy",
			"completeArticle": "Amongst the rubble of the destroyed libraries and lost literature, a Brawler, having learned their lesson, lamented that there's no way they could somehow record their new knowledge for future use.",
			"completeImage": "Buildings/Library",
			"type": "DestroyBuildings",
			"buildingType": "Library"
		}, {
			"name": "lose-adventurers",
			"addedHeadline": "Glorious Combat",
			"addedArticle": "Brawlers want for more adventurers to die in combat. They say its so they can go to the afterlife of warriors, but we think they're just taking bets on who's the next to go.",
			"addedImage": "sabre-slash",
			"completeHeadline": "Onward to Death!",
			"completeArticle": "The brawlers are really happy about all this ruthless combat. Not the ones that died, of course, but they're not here to say otherwise.",
			"completeImage": "sabre-slash",
			"type": "LoseAdventurers",
			"requireKill": true
		}
	],
	"Outrider": [
		{
			"name": "attract-outriders",
			"addedHeadline": "Heist Tryouts",
			"addedArticle": "We're putting together a heist and need a crew. Tryouts are soon, and if you do us a favour and get us some candidates, it won't be you we heist!",
			"addedImage": "Stats/Outrider",
			"completeHeadline": "Another Successful Heist",
			"completeArticle": "The outriders sing triumphant that they gather \"You should have seen it, there were so many people, it was so overly complicated. One of us was dangling from the ceiling, another hid in a box, it was great.\"",
			"completeImage": "Stats/Outrider",
			"type": "AttractAdventurers"
		}, {
			"name": "build-herbalists",
			"addedHeadline": "An Honest Plea",
			"addedArticle": "\"There's an awful scarcity of herbs available in our town, we're barely getting by. If you could build us a few more we would sure appreciate it.\"",
			"addedImage": "Buildings/Herbalist",
			"completeHeadline": "Herb Prices Plummet in Market Crash",
			"completeArticle": "Outrider's rejoice today, as their intentional flooding of the herb market has earned them a tidy profit on the fantasy stock market.",
			"completeImage": "Buildings/Herbalist",
			"type": "ConstructBuildings",
			"buildingType": "Herbalist"
		}, {
			"name": "preserve-forest",
			"addedHeadline": "Nature Appreciation Month Begins!",
			"addedArticle": "The outriders are asking that you use the land you've got, and do some development projects in a row without any forestry.",
			"addedImage": "forest",
			"completeHeadline": "Nature Appreciation Month is Over!",
			"completeArticle": "\"Thanks for keeping all those trees around, easier to rob people in the forest. We can get back to guilt free destroying our environment now, thanks again.\"",
			"completeImage": "saw",
			"type": "PreserveStructures",
			"structureType": "Terrain"
		}, {
			"name": "complete-quests",
			"addedHeadline": "The Explorers Spirit",
			"addedArticle": "The Outriders are getting sick of being stuck indoors, and want to explore the world. Completing quests might let them stretch their legs.",
			"addedImage": "map",
			"completeHeadline": "All Explored Out",
			"completeArticle": "The outriders are equal parts content and exhausted from their questing. Wiping the sweat off their forehead, one responded \"Phew! We uhhh, we really walked a lot... People don't really talk about how much walking is involved in being an adventurer, you usually skip over that part.\"",
			"completeImage": "map",
			"type": "CompleteQuests"
		}
	],
	"Performer": [
		{
			"name": "attract-performers",
			"addedHeadline": "Getting the Bands Back Together",
			"addedArticle": "The Performers want to put together a big show in your town. \"Yo bro if we get enough buzz going about this thing, your town could light up\"",
			"addedImage": "music-spell",
			"completeHeadline": "Battle of the Bards",
			"completeArticle": "The performers are happy with their music festival, one recalling \"Yo bro that was sick! I only saw like 2 shows from the other side of town though, the crowds were pretty big...\"",
			"completeImage": "music-spell",
			"type": "AttractAdventurers"
		}, {
			"name": "build-taverns",
			"addedHeadline": "Bar Hopping",
			"addedArticle": "The performers guild has a new request for the town, \"We want to put together a sick bar crawl, we just need more taverns to make this thing work...\"",
			"addedImage": "Buildings/Tavern",
			"completeHeadline": "Cross Dimensional Bar Crawl",
			"completeArticle": "The bar crawl's last stop was through a portal to another dimension. \"I saw things, man... Like 'reconsider your place in the universe' stuff. Honestly, the drinks were just 'meh' though, so might not go back.\"",
			"completeImage": "Buildings/Tavern",
			"type": "ConstructBuildings",
			"buildingType": "Tavern"
		}, {
			"name": "upset-arcanists",
			"addedHeadline": "Hazing Rituals",
			"addedArticle": "Performers have insisted we 'haze' the arcanists, by bullying them and taking away the things they like. \"We just want them to loosen up a little, get away from those books and come party with us! And what's a little teasing gonna do, anyway...\"",
			"addedImage": "jester-hat",
			"completeHeadline": "Prank Gone Too Far?!? (Not Clickbait)",
			"completeArticle": "A group of performers have returned from their 'time out' to the realm of eternity, arcanists were quoted saying \"It's just a prank, you should really loosen up\" in a mocking tone.",
			"completeImage": "empty-hourglass",
			"type": "KeepUpset",
			"targetGuild": "Arcanist"
		}, {
			"name": "clear-terrain",
			"addedHeadline": "There's Too Much 'Nature' Here!",
			"addedArticle": "The performers have grown a disdain for having to be around all the beautiful scenery. \"We should be the prettiest thing here, get rid of it!\"",
			"addedImage": "forest",
			"completeHeadline": "No More Nature",
			"completeArticle": "Performers are happy now that all that horrible nature has been cleared out. \"There, now everyone will have to pay to watch us instead.\"",
			"completeImage": "forest",
			"type": "DestroyStructures",
			"structureType": "Terrain"
		}
	],
	"Diviner": [
		{
			"name": "attract-diviners",
			"addedHeadline": "Peaceful Congregation",
			"addedArticle": "The diviners are interested in having more humble, pious, and peaceful folk in town, much like themselves.",
			"addedImage": "",
			"completeHeadline": "Not So Peaceful Congregation",
			"completeArticle": "The diviners, while happy with the influx of their own kind are only now realising that the one thing they hate more than sinners is other diviners.",
			"completeImage": "",
			"type": "AttractAdventurers"
		}, {
			"name": "build-shrines",
			"addedHeadline": "Rise & Shrine",
			"addedArticle": "The diviners are requesting more shrines be constructed to save the soul of the town \"nothing quite like an imposing, stone deity to inspire piety... and fear\".",
			"addedImage": "",
			"completeHeadline": "Ageing Like Fine Shrine",
			"completeArticle": "The diviners seem to be quite impressed by the number of new shrines... but are now realising that they may have not all has the same idea on which gods they would be for...",
			"completeImage": "",
			"type": "ConstructBuildings",
			"buildingType": "Shrine"
		}, {
			"name": "destroy-taverns",
			"addedHeadline": "Smite Their Right to Paaartay!",
			"addedArticle": "The diviners are chomping at the bit to smite those sin-parlours of debauchery. They are requesting they be torn down immediately!",
			"addedImage": "",
			"completeHeadline": "Tearing Down the Establishment (of Sin)",
			"completeArticle": "Diviners frolicked with merriment following the destruction of several, local taverns. They intend to capitalise on this turn of events by proposing \"ample penance and self-flagellation\" to the former patrons as a replacement for \"drunken tomfoolery\".",
			"completeImage": "",
			"type": "DestroyBuildings",
			"buildingType": "Tavern"
		}, {
			"name": "clear-ruins",
			"addedHeadline": "Clear Ruins",
			"addedArticle": "The diviners are requesting that you... erase of some the ruins around the place, stating \"the past describes a bunch of stuff we'd rather people forget, no point keeping them around, right?\".",
			"addedImage": "",
			"completeHeadline": "Ruins Cleared",
			"completeArticle": "The diviners are pleased by the removal of the ruins; \"Glad we don't have to think about THOSE atrocities again!\"",
			"completeImage": "",
			"type": "DestroyStructures",
			"structureType": "Ruins"
		}
	],
	"Arcanist": [
		{
			"name": "attract-arcanists",
			"addedHeadline": "Ritual invites",
			"addedArticle": "The arcanist are conducting a big, important, and very secret ritual. They are requesting need more mages for it to proceed. They won't tell us what it's for, I don't think we're invited.",
			"addedImage": "Stats/Arcanist",
			"completeHeadline": "Wizard Tower Sleepover",
			"completeArticle": "All the arcanists gathered for their 'mysterious ritual', which our investigative journalist uncovered to be a board game night.",
			"completeImage": "dice-twenty-faces-twenty",
			"type": "AttractAdventurers"
		}, {
			"name": "build-libraries",
			"addedHeadline": "More Books Please",
			"addedArticle": "The arcanists want more books, what else is new?",
			"addedImage": "",
			"completeHeadline": "This is a Good Amount of Books",
			"completeArticle": "The arcanists are happy with all these new books because of course.",
			"completeImage": "",
			"type": "ConstructBuildings",
			"buildingType": "Library"
		}, {
			"name": "upset-diviners",
			"addedHeadline": "Upset Diviners",
			"addedArticle": "Arcanists are requesting we upset the \"We really don't like them, so self righteous. All we did was summon the devil once or twice...\"",
			"addedImage": "",
			"completeHeadline": "Diviners Upset",
			"completeArticle": "The diviners are upset, which has made the arcanists very happy.",
			"completeImage": "",
			"type": "KeepUpset",
			"targetGuild": "Diviner"
		}, {
			"name": "preserve-ruins",
			"addedHeadline": "Preserve Ruins",
			"addedArticle": "The arcanists guild have come with a new request, to preserve the ancient ruins surrounding our town. \"We're trying to get a research grant, and we just need to hold out a little longer...\"",
			"addedImage": "",
			"completeHeadline": "Ruins Preserved",
			"completeArticle": "\"Ok, we got the money, burn it down now\"",
			"completeImage": "",
			"type": "PreserveStructures",
			"structureType": "Ruins"
		}
	]
}
