[
  {
    "name": "opening",
    "headline": "Town Founded!",
    "article": "We celebrate today as being the day that we found our new town upon these mysterious ruins. Here's hoping we'll be kept safe from those strange growls in the night!",
    "image": "village",
    "type": "Other",
    "outcomes": [
      {
        "type": "FlavourText",
        "customDescription": "A scouting party has joined us to get started."
      },
      {
        "type": "AdventurersAdded",
        "count": 3,
        "anyGuild": true
      }
    ]
  },
  {
    "name": "game-over-1",
    "headline": "Adventurers Guild Pulls Support from town",
    "article": "Due the overwhelming threat of the local area, the adventures guild has retreated out of the town. Unfortunately this means it's only a matter of time now until something comes along and wipes us out. I'd recommend starting to run now.",
    "image": "demolish",
    "type": "Other",
    "outcomes": [
      {
        "type": "GameOver"
      }
    ]
  },
  {
    "name": "game-over-2",
    "headline": "No More News Today",
    "article": "It's over... Maybe we'll do better next time?",
    "type": "Other"
  },
  {
    "name": "game-over-3",
    "headline": "Local Reporter Looking for Work",
    "article": "Anyone hiring? I would appreciate it.",
    "type": "Other"
  },
  {
    "name": "guild-hall-destroyed",
    "headline": "Insane Town Mayor Destroys own Guild Hall",
    "article": "Outrage today, as our iconic town guild hall has been demolished in a fit of madness by our newly deposed mayor. Such an insult to the adventurers guild has not gone unnoticed, and all support from local adventurers has been pulled out of the town. It's only a matter of time now before this place gets overrun, and this reporter is getting out of here!",
    "image": "demolish",
    "type": "Other"
  },
  {
    "name": "summer-start",
    "headline": "Summer Night's Dream",
    "article": "The sun sets on this burgeoning hamlet, as scored by the cicadas and choreographed by the glowflies. They do so with the knowing of another day ahead, entirely oblivious to the tides of professional adventuring and corporate politics.",
    "image": "summer",
    "type": "Other"
  },
  {
    "name": "autumn-start",
    "headline": "Autumn Auspice",
    "article": "The ruins of a bustling adventuring hub sit, ever yielding to the encroaching wilderness. The goblin raid, dragon attack, two separate spell-casting accidents and bridge troll strike of just one week prior are already a distant memory for the reddening foliage.",
    "image": "autumn",
    "type": "Other"
  },
  {
    "name": "winter-start",
    "headline": "Winter's Cold Whistle",
    "article": "The cold air cracks against the smithy's door, demanding entrance. Hubris might explain the structure's staunch defiance against inevitable demise, but as some keen onlookers might note, market forces often outweigh reality.",
    "image": "winter",
    "type": "Other"
  }
]
